FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*
 * Some constants, hardware definitions and comments taken from ST's HAL driver
 * library, COPYRIGHT(c) 2015 STMicroelectronics.
 */

/*
 * FreeRTOS+TCP <DEVELOPMENT BRANCH>
 * Copyright (C) 2022 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * SPDX-License-Identifier: MIT
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/* Standard includes. */
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

/* FreeRTOS+TCP includes. */
#include "FreeRTOS_IP.h"
#include "FreeRTOS_IP_Private.h"
#include "NetworkBufferManagement.h"
#include "NetworkInterface.h"
#include "phyHandling.h"

/* ST includes. */
#if defined(STM32F4)
    #include "stm32f4xx_hal_eth.h"
#elif defined(STM32F7)
    #include "stm32f7xx_hal_eth.h"
#elif defined(STM32H7)
    #include "stm32h7xx_hal_eth.h"
#elif defined(STM32H5)
    /* Untested */
    #include "stm32h5xx_hal_eth.h"
#else
    #error Unknown STM32 Family for NetworkInterface
#endif

/*-----------------------------------------------------------*/

/* TODO: Should these be moved to FreeRTOSIPConfigDefaults.h? */
#ifndef ipconfigETHERNET_AN_ENABLE
    #define ipconfigETHERNET_AN_ENABLE 1
#endif

#if ( ipconfigETHERNET_AN_ENABLE == 0 )
    #ifndef ipconfigETHERNET_USE_100MB
        #define ipconfigETHERNET_USE_100MB 1
    #endif

    #ifndef ipconfigETHERNET_USE_FULL_DUPLEX
        #define ipconfigETHERNET_USE_FULL_DUPLEX 1
    #endif
#endif

#ifndef ipconfigETHERNET_AUTO_CROSS_ENABLE
    #define ipconfigETHERNET_AUTO_CROSS_ENABLE 1
#endif

#if ( ipconfigETHERNET_AUTO_CROSS_ENABLE == 0 )
    #ifndef ipconfigETHERNET_CROSSED_LINK
        #define ipconfigETHERNET_CROSSED_LINK 0
    #endif
#endif

#ifndef ipconfigUSE_RMII
    #define ipconfigUSE_RMII 1
#endif

/*-----------------------------------------------------------*/

/* TODO: Verify this size */
#define NETWORK_BUFFER_SIZE ( ( ( ETH_RX_BUF_SIZE + ipBUFFER_PADDING ) + 7 ) & ~0x7UL )

#define EMAC_IF_RX_EVENT 1UL
#define EMAC_IF_TX_EVENT 2UL
#define EMAC_IF_ERR_EVENT 4UL
#define EMAC_IF_ALL_EVENT ( EMAC_IF_RX_EVENT | EMAC_IF_TX_EVENT | EMAC_IF_ERR_EVENT )

typedef enum
{
    eMACInit,
    eMACPass,
    eMACFailed
} eMAC_INIT_STATUS_TYPE;

/*-----------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInput( void );

static void prvEMACHandlerTask( void * pvParameters ) __attribute__((__noreturn__));

static BaseType_t prvAcceptPacket( const uint8_t * const pucEthernetBuffer );

static BaseType_t prvPhyReadReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t * pulValue );

static BaseType_t prvPhyWriteReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t ulValue );

static void prvEthernetUpdateConfig( void );

/*-----------------------------------------------------------*/

static ETH_HandleTypeDef xEthHandle;

static ETH_DMADescTypeDef DMARxDscrTab[ ETH_RX_DESC_CNT ] __attribute__( ( section( ".RxDescripSection" ) ) );

/* TODO: implement ( ipconfigZERO_COPY_RX_DRIVER == 0 ) */
/*#if ( ipconfigZERO_COPY_RX_DRIVER == 0 )
    __ALIGN_BEGIN uint8_t Rx_Buff[ ETH_RX_DESC_CNT ][ ETH_RX_BUF_SIZE ] __ALIGN_END;
#endif*/

static ETH_DMADescTypeDef DMATxDscrTab[ ETH_TX_DESC_CNT ] __attribute__( ( section( ".TxDescripSection" ) ) );

/* TODO: implement ( ipconfigZERO_COPY_TX_DRIVER == 0 ) */
/*#if ( ipconfigZERO_COPY_TX_DRIVER == 0 )
    __ALIGN_BEGIN uint8_t Tx_Buff[ ETH_TX_DESC_CNT ][ ETH_TX_BUF_SIZE ] __ALIGN_END;
#endif*/

static ETH_TxPacketConfig xTxConfig;

/* TODO: implement ( ipconfigUSE_LLMNR != 0 ) */
/*#if ( ipconfigUSE_LLMNR != 0 )
    static const uint8_t xLLMNR_MACAddress[] = { 0x01, 0x00, 0x5E, 0x00, 0x00, 0xFC };
#endif*/

static TaskHandle_t xEMACTaskHandle;

static SemaphoreHandle_t xTxMutex;

/* TODO: uncomment this after chaining Tx Buffers */
/* xTxDescSem is not useful unless xTxBuffer.next != NULL */
/* static SemaphoreHandle_t xTxDescSem; */

static EthernetPhy_t xPhyObject;

static const PhyProperties_t xPHYProperties =
{
    #if ( ipconfigETHERNET_AN_ENABLE != 0 )
        .ucSpeed      = PHY_SPEED_AUTO,
        .ucDuplex     = PHY_DUPLEX_AUTO,
    #else
        #if ( ipconfigETHERNET_USE_100MB != 0 )
            .ucSpeed  = PHY_SPEED_100,
        #else
            .ucSpeed  = PHY_SPEED_10,
        #endif

        #if ( ipconfigETHERNET_USE_FULL_DUPLEX != 0 )
            .ucDuplex = PHY_DUPLEX_FULL,
        #else
            .ucDuplex = PHY_DUPLEX_HALF,
        #endif
    #endif

    #if ( ipconfigETHERNET_AN_ENABLE != 0 ) && ( ipconfigETHERNET_AUTO_CROSS_ENABLE != 0 )
        .ucMDI_X      = PHY_MDIX_AUTO,
    #elif ( ipconfigETHERNET_CROSSED_LINK != 0 )
        .ucMDI_X      = PHY_MDIX_CROSSED,
    #else
        .ucMDI_X      = PHY_MDIX_DIRECT,
    #endif
};

/*-----------------------------------------------------------*/

void vNetworkInterfaceAllocateRAMToBuffers( NetworkBufferDescriptor_t pxNetworkBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ] )
{
    static uint8_t ucNetworkPackets[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ][ NETWORK_BUFFER_SIZE ] __attribute__( ( aligned( 4 ), section( ".EthBuffersSection" ) ) );

    for( size_t ul = 0; ul < ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS; ul++ )
    {
        pxNetworkBuffers[ ul ].pucEthernetBuffer = &( ucNetworkPackets[ ul ][ ipBUFFER_PADDING ] );
        *( ( uint32_t * ) &( ucNetworkPackets[ ul ][ 0 ] ) ) = ( uint32_t ) ( &( pxNetworkBuffers[ ul ] ) );
    }
}

/*-----------------------------------------------------------*/

BaseType_t xGetPhyLinkStatus( void )
{
    BaseType_t xReturn = pdFAIL;

    if( xPhyObject.ulLinkStatusMask != 0U )
    {
        xReturn = pdPASS;
    }

    return xReturn;
}
/*-----------------------------------------------------------*/

BaseType_t xNetworkInterfaceInitialise( void )
{
    BaseType_t xResult = pdFAIL;
    BaseType_t xPhyResult;
    HAL_StatusTypeDef xHalResult;

    static eMAC_INIT_STATUS_TYPE xMacInitStatus = eMACInit;

    if( xMacInitStatus == eMACInit )
    {
        if( xEMACTaskHandle == NULL )
        {
            #if ( configSUPPORT_STATIC_ALLOCATION != 0 )
                static StaticSemaphore_t xTxMutexBuf;
                xTxMutex = xSemaphoreCreateMutexStatic( &xTxMutexBuf );

                /* TODO: uncomment this after chaining Tx Buffers */
                /* static StaticSemaphore_t xTxDescSemBuf;
                xTxDescSem = xSemaphoreCreateCountingStatic( ( UBaseType_t ) ETH_TX_DESC_CNT, ( UBaseType_t ) ETH_TX_DESC_CNT, &xTxDescSemBuf ); */

                static StackType_t uxEMACTaskStack[ ( 2 * configMINIMAL_STACK_SIZE ) ];
                static StaticTask_t xEMACTaskTCB;
                /* TODO: Allow stack size & priority to be defined */
                xEMACTaskHandle = xTaskCreateStatic(
                    prvEMACHandlerTask,
                    "EMAC",
                    ( 2 * configMINIMAL_STACK_SIZE ),
                    NULL,
                    ( configMAX_PRIORITIES - 1 ),
                    uxEMACTaskStack,
                    &xEMACTaskTCB
                );
            #else
                xTxMutex = xSemaphoreCreateMutex();

                /* TODO: uncomment this after chaining Tx Buffers */
                /*xTxDescSem = xSemaphoreCreateCounting(
                    ( UBaseType_t ) ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS,
                    ( UBaseType_t ) ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS
                );*/

                /* TODO: Allow stack size & priority to be defined */
                ( void ) xTaskCreate(
                    prvEMACHandlerTask,
                    "EMAC",
                    ( 2 * configMINIMAL_STACK_SIZE ),
                    NULL,
                    ( configMAX_PRIORITIES - 1 ),
                    &xEMACTaskHandle
                );
            #endif
            configASSERT( xTxMutex );
            vQueueAddToRegistry( xTxMutex, "TXMutex" );

            /* TODO: uncomment this after chaining Tx Buffers */
            /*configASSERT( xTxDescSem );
            vQueueAddToRegistry( xTxDescSem, "xTxDescSem" );*/

            configASSERT( xEMACTaskHandle );
        }

        if( xEthHandle.Instance == NULL )
        {
            xEthHandle.Instance = ETH;
            xEthHandle.Init.MACAddr = ( uint8_t * ) FreeRTOS_GetMACAddress();
            xEthHandle.Init.MediaInterface = ( ipconfigUSE_RMII != 0 ) ? HAL_ETH_RMII_MODE : HAL_ETH_MII_MODE;
            xEthHandle.Init.TxDesc = DMATxDscrTab;
            xEthHandle.Init.RxDesc = DMARxDscrTab;
            /* TODO: Verify RxBuffLen size */
            xEthHandle.Init.RxBuffLen = ETH_RX_BUF_SIZE;

            memset( &DMATxDscrTab, 0, sizeof( DMATxDscrTab ) );
            memset( &DMARxDscrTab, 0, sizeof( DMARxDscrTab ) );

            #if defined(STM32F7) || defined(STM32F4)
                /* This function doesn't get called in Fxx driver */
                HAL_ETH_SetMDIOClockRange( &xEthHandle );
            #endif

