FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            xHalResult = HAL_ETH_Init( &xEthHandle );
            configASSERT( xHalResult == HAL_OK );
            configASSERT( xEthHandle.ErrorCode == HAL_ETH_ERROR_NONE );
            configASSERT( xEthHandle.gState == HAL_ETH_STATE_READY );

            /* TODO: uncomment & test these */
            /*#if ( ipconfigUSE_LLMNR != 0 ) || ( ipconfigUSE_MDNS != 0 )
                BaseType_t xMACEntry = ETH_MAC_ADDRESS1;
                uint8_t pMACAddr[6];
                memset( &pMACAddr, 0, sizeof( pMACAddr ) );
                xHalResult = HAL_ETH_SetSourceMACAddrMatch( &xEthHandle, xMACEntry, pMACAddr );
                configASSERT( xHalResult == HAL_OK );
            #endif

            #if ( ipconfigUSE_MDNS != 0 )
                xHalResult = HAL_ETH_SetSourceMACAddrMatch( &xEthHandle, xMACEntry, ( uint8_t * ) xMDNS_MACAddressIPv4 );
                configASSERT( xHalResult == HAL_OK );
                xMACEntry += 8;
            #endif
            #if ( ipconfigUSE_LLMNR != 0 )
                xHalResult = HAL_ETH_SetSourceMACAddrMatch( &xEthHandle, xMACEntry, ( uint8_t * ) xLLMNR_MACAddress );
                configASSERT( xHalResult == HAL_OK );
                xMACEntry += 8;
            #endif*/

            memset( &xTxConfig, 0, sizeof( xTxConfig ) );
            xTxConfig.Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD;
            xTxConfig.CRCPadCtrl = ETH_CRC_PAD_INSERT;
            #if ( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM != 0 )
                xTxConfig.Attributes |= ETH_TX_PACKETS_FEATURES_CSUM;
                xTxConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
            #else
                xTxConfig.ChecksumCtrl = ETH_CHECKSUM_DISABLE;
            #endif
            xMacInitStatus = eMACPass;
        }
    }

    if( xMacInitStatus == eMACPass )
    {
        vPhyInitialise( &xPhyObject, ( xApplicationPhyReadHook_t ) prvPhyReadReg, ( xApplicationPhyWriteHook_t ) prvPhyWriteReg );
        xPhyResult = xPhyDiscover( &xPhyObject );
        configASSERT( xPhyResult > 0 );
        xPhyResult = xPhyConfigure( &xPhyObject, &xPHYProperties );
        configASSERT( xPhyResult == 0 );
        xPhyResult = xPhyStartAutoNegotiation( &xPhyObject, xPhyGetMask( &xPhyObject ) );
        configASSERT( xPhyResult == 0 );
    }

    if ( xGetPhyLinkStatus() != pdFAIL )
    {
        ETH_MACConfigTypeDef MACConf;
        xHalResult = HAL_ETH_GetMACConfig( &xEthHandle , &MACConf );
        configASSERT( xHalResult == HAL_OK );
        MACConf.DuplexMode = ( xPhyObject.xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
        MACConf.Speed = ( xPhyObject.xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;
        MACConf.ChecksumOffload = ( FunctionalState ) ( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM != 0 );
        xHalResult = HAL_ETH_SetMACConfig( &xEthHandle, &MACConf );
        configASSERT( xHalResult == HAL_OK );
        xHalResult = HAL_ETH_Start_IT( &xEthHandle );
        configASSERT( xHalResult == HAL_OK );
        xResult = pdPASS;
    }

    return xResult;
}

/*-----------------------------------------------------------*/

BaseType_t xNetworkInterfaceOutput( NetworkBufferDescriptor_t * const pxDescriptor, BaseType_t xReleaseAfterSend )
{
    BaseType_t xResult = pdFAIL;
    /* TODO: ipconfigZERO_COPY_TX_DRIVER */

    if( pxDescriptor != NULL )
    {
        if( xGetPhyLinkStatus() != pdFAIL )
        {
            /* TODO: Tx Optimization by setting .next? */
            ETH_BufferTypeDef xTxBuffer = {
                .buffer = ( uint8_t * ) pxDescriptor->pucEthernetBuffer,
                .len = pxDescriptor->xDataLength,
                .next = NULL
            };

            xTxConfig.Length = xTxBuffer.len;
            xTxConfig.TxBuffer = &xTxBuffer;
            xTxConfig.pData = pxDescriptor;

            if( xTxConfig.Length <= ETH_TX_BUF_SIZE - ipBUFFER_PADDING )
            {
                /* TODO: uncomment this after chaining Tx Buffers */
                /* if( xSemaphoreTake( xTxDescSem, pdMS_TO_TICKS( 100U ) ) != pdFALSE )
                { */
                    if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 20U ) ) != pdFALSE )
                    {
                        xReleaseAfterSend = pdFALSE;
                        if( HAL_ETH_Transmit_IT( &xEthHandle, &xTxConfig ) == HAL_OK )
                        {
                            xResult = pdPASS;
                        }
                        else
                        {
                            configASSERT( xEthHandle.ErrorCode != HAL_ETH_ERROR_PARAM );
                            configASSERT( xEthHandle.gState == HAL_ETH_STATE_STARTED );
                        }
                        xSemaphoreGive( xTxMutex );
                    }
                    /* TODO: uncomment this after chaining Tx Buffers */
                    /* else
                    {
                        xSemaphoreGive( xTxDescSem );
                    }
                } */
            }
        }

        if( xReleaseAfterSend != pdFALSE )
        {
            vReleaseNetworkBufferAndDescriptor( pxDescriptor );
        }
    }

    return xResult;
}

/*-----------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInput( void )
{
    /* TODO: ipconfigZERO_COPY_RX_DRIVER */
    BaseType_t xResult = 0;
    NetworkBufferDescriptor_t * pStartDescriptor = NULL;
    while ( HAL_ETH_ReadData( &xEthHandle, ( void ** ) &pStartDescriptor ) == HAL_OK )
    {
        xResult++;
        if ( pStartDescriptor != NULL )
        {
            const IPStackEvent_t xRxEvent = {
                .eEventType = eNetworkRxEvent,
                .pvData = ( void * ) pStartDescriptor
            };

            if( xSendEventStructToIPTask( &xRxEvent, ( TickType_t ) 0U ) != pdPASS )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                NetworkBufferDescriptor_t * pxDescriptorToClear = pStartDescriptor;
                do {
                    #if ( ipconfigUSE_LINKED_RX_MESSAGES != 0 )
                        NetworkBufferDescriptor_t * pxNext = pxDescriptorToClear->pxNextBuffer;
                    #else
                        NetworkBufferDescriptor_t * pxNext = NULL;
                    #endif
                    vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
                    pxDescriptorToClear = pxNext;
                } while( pxDescriptorToClear != NULL );
            }
        }
    }
    configASSERT( xEthHandle.ErrorCode != HAL_ETH_ERROR_PARAM );
    configASSERT( xEthHandle.gState == HAL_ETH_STATE_STARTED );
    return ( BaseType_t ) ( xResult > 0 );
}

/*-----------------------------------------------------------*/

static void prvEMACHandlerTask( void * pvParameters )
{
    ( void ) pvParameters;

    for( ;; )
    {
        BaseType_t xResult = 0U;

