FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
        uint32_t ulISREvents = 0U;

        if ( xTaskNotifyWait( 0U, EMAC_IF_ALL_EVENT, &ulISREvents, pdMS_TO_TICKS( 500UL ) ) == pdTRUE )
        {
            if( ( ulISREvents & EMAC_IF_RX_EVENT ) != 0 )
            {
                iptraceNETWORK_INTERFACE_RECEIVE();
                xResult = prvNetworkInterfaceInput();
            }

            if( ( ulISREvents & EMAC_IF_TX_EVENT ) != 0 )
            {
                iptraceNETWORK_INTERFACE_TRANSMIT();
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 100U ) ) != pdFALSE )
                {
                    HAL_StatusTypeDef xHalResult = HAL_ETH_ReleaseTxPacket( &xEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    xSemaphoreGive( xTxMutex );
                }
            }

            if( ( ulISREvents & EMAC_IF_ERR_EVENT ) != 0 )
            {
                /* TODO: Does this recover from fatal bus error? */
                HAL_ETH_Stop_IT( &xEthHandle );
                /* FreeRTOS_NetworkDown()
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 100U ) ) != pdFALSE )
                {
                    configASSERT( HAL_ETH_ReleaseTxPacket( &xEthHandle ) == HAL_OK );
                    xSemaphoreGive( xTxMutex );
                }*/
                HAL_ETH_Start_IT( &xEthHandle );
            }
        }

        if( xPhyCheckLinkStatus( &xPhyObject, xResult ) != 0 )
        {
            prvEthernetUpdateConfig();
        }
    }
}

/*-----------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const uint8_t * const pucEthernetBuffer )
{
    BaseType_t xResult = pdFALSE;

    do {
        uint32_t pErrorCode = 0;
        HAL_StatusTypeDef xHalResult = HAL_ETH_GetRxDataErrorCode( &xEthHandle, &pErrorCode );
        configASSERT( xHalResult == HAL_OK );
        if ( pErrorCode != 0 )
        {
            break;
        }

        const ProtocolPacket_t * pxProtPacket = ( const ProtocolPacket_t * ) pucEthernetBuffer;

        const uint16_t usFrameType = pxProtPacket->xTCPPacket.xEthernetHeader.usFrameType;

        #if ( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES != 0 )
            if( usFrameType != ipARP_FRAME_TYPE && usFrameType != ipIPv4_FRAME_TYPE)
            {
                break;
            }
        #endif
        #if ( ipconfigETHERNET_DRIVER_FILTERS_PACKETS != 0 )
            if( usFrameType == ipIPv4_FRAME_TYPE )
            {
                const IPHeader_t * pxIPHeader = &( pxProtPacket->xTCPPacket.xIPHeader );

                if( ( pxIPHeader->usFragmentOffset & ipFRAGMENT_OFFSET_BIT_MASK ) != 0U )
                {
                    break;
                }

                if( ( pxIPHeader->ucVersionHeaderLength < 0x45 ) || ( pxIPHeader->ucVersionHeaderLength > 0x4F ) )
                {
                    break;
                }

                const uint32_t ulDestinationIPAddress = pxIPHeader->ulDestinationIPAddress;

                if( ( *ipLOCAL_IP_ADDRESS_POINTER != 0 ) && ( ulDestinationIPAddress != *ipLOCAL_IP_ADDRESS_POINTER ) && ( ( FreeRTOS_ntohl( ulDestinationIPAddress ) & 0xff ) != 0xff ) )
                {
                    break;
                }

                if( pxIPHeader->ucProtocol == ipPROTOCOL_UDP )
                {
                    if( ( xPortHasUDPSocket( pxProtPacket->xUDPPacket.xUDPHeader.usDestinationPort ) == pdFALSE ))
                    {
                        break;
                    }
                    /* TODO: uncomment these & test */
                    /*#if ipconfigUSE_LLMNR == 1
                        && ( usDestinationPort != ipLLMNR_PORT ) &&
                        ( usSourcePort != ipLLMNR_PORT )
                    #endif
                    #if ipconfigUSE_MDNS == 1
                        && ( usDestinationPort != ipMDNS_PORT ) &&
                        ( usSourcePort != ipMDNS_PORT )
                    #endif
                    #if ipconfigUSE_NBNS == 1
                        && ( usDestinationPort != ipNBNS_PORT ) &&
                        ( usSourcePort != ipNBNS_PORT )
                    #endif
                    #if ipconfigUSE_DNS == 1
                        && ( usSourcePort != ipDNS_PORT )
                    #endif
                    )*/
                }
            }
        #endif

        xResult = pdTRUE;
    } while( ipFALSE_BOOL );

    return xResult;
}

/*-----------------------------------------------------------*/

static BaseType_t prvPhyReadReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t * pulValue )
{
    BaseType_t iResult = -1;
    if( HAL_ETH_ReadPHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, pulValue ) == HAL_OK )
    {
        iResult = 0;
    }
    return iResult;
}

/*-----------------------------------------------------------*/

static BaseType_t prvPhyWriteReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t ulValue )
{
    BaseType_t iResult = -1;
    if( HAL_ETH_WritePHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, ulValue ) == HAL_OK )
    {
        iResult = 0;
    }
    return iResult;
}

/*-----------------------------------------------------------*/

static void prvEthernetUpdateConfig( void )
{
    BaseType_t xPhyResult;
    HAL_StatusTypeDef xHalResult;
    /* TODO: xEthHandle.gState == Check HAL_ETH_STATE_STARTED */

    if( xGetPhyLinkStatus() != pdFAIL )
    {
        ETH_MACConfigTypeDef MACConf;
        xHalResult = HAL_ETH_GetMACConfig( &xEthHandle , &MACConf );
        configASSERT( xHalResult == HAL_OK );

        #if ( ipconfigETHERNET_AN_ENABLE != 0 )
            xPhyResult = xPhyStartAutoNegotiation( &xPhyObject, xPhyGetMask( &xPhyObject ) );
            configASSERT( xPhyResult == 0 );

            MACConf.DuplexMode = ( xPhyObject.xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
            MACConf.Speed = ( xPhyObject.xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;

            xHalResult = HAL_ETH_SetMACConfig( &xEthHandle, &MACConf );
            configASSERT( xHalResult == HAL_OK );
        #else
            xPhyObject.xPhyPreferences.ucDuplex = ( MACConf.DuplexMode == ETH_FULLDUPLEX_MODE ) ? PHY_DUPLEX_FULL : PHY_DUPLEX_HALF;
            xPhyObject.xPhyPreferences.ucSpeed = ( MACConf.Speed == ETH_SPEED_10M ) ? PHY_SPEED_10 : PHY_SPEED_100;
            xPhyObject.xPhyPreferences.ucMDI_X = PHY_MDIX_AUTO;
            xPhyFixedValue( &xPhyObject, xPhyGetMask( &xPhyObject ) );
        #endif

        if( xGetPhyLinkStatus() != pdFAIL )
        {
            ( void ) HAL_ETH_Start_IT( &xEthHandle );
        }
    }
    else
    {
        if( HAL_ETH_Stop_IT( &xEthHandle ) == HAL_OK )
        {
            /* iptraceNETWORK_INTERFACE_STATUS_CHANGE(); */
            if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 100U ) ) != pdFALSE )
            {
                xHalResult = HAL_ETH_ReleaseTxPacket( &xEthHandle );
                configASSERT( xHalResult == HAL_OK );
                memset( &DMATxDscrTab, 0, sizeof( DMATxDscrTab ) );
                ( void ) xSemaphoreGive( xTxMutex );
            }
        }
    }
}

/*-----------------------------------------------------------*/

void ETH_IRQHandler( void )
{
    HAL_ETH_IRQHandler( &xEthHandle );
}

/*-----------------------------------------------------------*/

