FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
void HAL_ETH_RxCpltCallback( ETH_HandleTypeDef * heth )
{
    static size_t uxMostRXDescsUsed = 0U;

    const size_t uxRxUsed = heth->RxDescList.RxDescCnt;

    if( uxMostRXDescsUsed < uxRxUsed )
    {
        uxMostRXDescsUsed = uxRxUsed;
    }

    if( xEMACTaskHandle != NULL )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xTaskNotifyFromISR( xEMACTaskHandle, EMAC_IF_RX_EVENT, eSetBits, &xHigherPriorityTaskWoken );
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
}

/*-----------------------------------------------------------*/

void HAL_ETH_TxCpltCallback( ETH_HandleTypeDef * heth )
{
    static size_t uxMostTXDescsUsed = 0U;

    const size_t uxTxUsed = heth->TxDescList.BuffersInUse;

    if( uxMostTXDescsUsed < uxTxUsed )
    {
        uxMostTXDescsUsed = uxTxUsed;
    }

    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xTaskNotifyFromISR( xEMACTaskHandle, EMAC_IF_TX_EVENT, eSetBits, &xHigherPriorityTaskWoken );
    portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
}

/*-----------------------------------------------------------*/

void HAL_ETH_ErrorCallback( ETH_HandleTypeDef *heth )
{
    if( HAL_ETH_GetError( heth ) & HAL_ETH_ERROR_DMA )
    {
        if( HAL_ETH_GetDMAError( heth ) )
        {
            if( heth->gState == HAL_ETH_STATE_ERROR )
            {
                /* fatal bus error occurred */
                /* F7 - ETH_DMASR_FBES | ETH_DMASR_TPS | ETH_DMASR_RPS */
                /* H7 - ETH_DMACSR_FBE | ETH_DMACSR_TPS | ETH_DMACSR_RPS */
                BaseType_t xHigherPriorityTaskWoken = pdFALSE;
                xTaskNotifyFromISR( xEMACTaskHandle, EMAC_IF_ERR_EVENT, eSetBits, &xHigherPriorityTaskWoken );
                portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
            }
            else
            {
                /* F7 - ETH_DMASR_ETS | ETH_DMASR_RWTS | ETH_DMASR_RBUS | ETH_DMASR_AIS */
                /* H7 - ETH_DMACSR_CDE | ETH_DMACSR_ETI | ETH_DMACSR_RWT | ETH_DMACSR_RBU | ETH_DMACSR_AIS */
                /* TODO: Check if allocated in HAL_ETH_RxAllocateCallback before error interrupt, then release in task */
                /*if( ( HAL_ETH_GetDMAError(heth) & ETH_DMACSR_RBU ) == ETH_DMACSR_RBU )
                {

                }*/
                /* TODO: same as above but for Tx */
                /*if( ( HAL_ETH_GetDMAError(heth) & ETH_DMACSR_TBU ) == ETH_DMACSR_TBU )
                {
                    xSemaphoreGiveFromISR( xTxDescSem );
                }*/
            }
        }
    }

    #ifdef STM32H7
        if( HAL_ETH_GetError( heth ) & HAL_ETH_ERROR_MAC )
        {
            if( HAL_ETH_GetMACError( heth ) )
            {

            }
        }
    #endif
}

/*-----------------------------------------------------------*/

void HAL_ETH_RxAllocateCallback( uint8_t **buff )
{
    /* TODO: Verify this size */
    NetworkBufferDescriptor_t * pxBufferDescriptor = pxGetNetworkBufferWithDescriptor( ETH_RX_BUF_SIZE, pdMS_TO_TICKS( 20U ) );
    if( pxBufferDescriptor != NULL )
    {
        *buff = pxBufferDescriptor->pucEthernetBuffer;
    }
}

/*-----------------------------------------------------------*/

void HAL_ETH_RxLinkCallback( void **pStart, void **pEnd, uint8_t *buff, uint16_t Length )
{
    NetworkBufferDescriptor_t * pxCurDescriptor = pxPacketBuffer_to_NetworkBuffer( ( const void * ) buff );
    if( pxCurDescriptor != NULL )
    {
        if ( prvAcceptPacket( pxCurDescriptor->pucEthernetBuffer ) == pdTRUE )
        {
            NetworkBufferDescriptor_t ** pStartDescriptor = ( NetworkBufferDescriptor_t ** ) pStart;
            NetworkBufferDescriptor_t ** pEndDescriptor = ( NetworkBufferDescriptor_t ** ) pEnd;

            pxCurDescriptor->xDataLength = Length;
            #if ( ipconfigUSE_LINKED_RX_MESSAGES != 0 )
                pxCurDescriptor->pxNextBuffer = NULL;
            #endif
            if( *pStartDescriptor == NULL )
            {
                *pStartDescriptor = pxCurDescriptor;
            }
            #if ( ipconfigUSE_LINKED_RX_MESSAGES != 0 )
                else if( pEndDescriptor != NULL )
                {
                    ( *pEndDescriptor )->pxNextBuffer = pxCurDescriptor;
                }
            #endif
            *pEndDescriptor = pxCurDescriptor;
        }
        else
        {
            vReleaseNetworkBufferAndDescriptor( pxCurDescriptor );
        }
    }
}

/*-----------------------------------------------------------*/

void HAL_ETH_TxFreeCallback( uint32_t *buff )
{
    NetworkBufferDescriptor_t * pxNetworkBuffer = ( NetworkBufferDescriptor_t * ) buff;
    vReleaseNetworkBufferAndDescriptor( pxNetworkBuffer );
    /* TODO: uncomment this after chaining Tx Buffers */
    /* xSemaphoreGive( xTxDescSem ); */
}

/*-----------------------------------------------------------*/
